app/Controllers/Login_controller.php

	public function auth()
	{
		$session = session();
		$model = new usuario_Model();

		// traemos los datos del formulario

		$usuario = $this->request-> getVar('usuario');
		$password = $this->request->getVar('pass');

		$data = $model ->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'ale23'
 LIMIT 1