app/Controllers/Usuariocontroller.php

        echo view("back/usuario/registro", ['validation' => $this->validator, 'titulo' => $data['titulo']]);
        echo view("front/footer_view");
    }else {
        $formModel->save([
            'nombre'=>$this->request-> getVar('nombre'),
            'apellido'=>$this->request-> getVar('apellido'),
            'usuario'=>$this->request-> getVar('usuario'),
            'email'=>$this->request->getVar('email'),
            'pass'=>password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),
        ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('alejandra', 'rodriguez', 'ale23', 'alecha@gmail.com', '$2y$10$16QGjK.qox3DrZOiWaRaZOOfzsUMxDzHBEYdmxpBCePELbD0KNdMK')